In [ ]:
import pandas as pd
import io

In [ ]:
pd.__version__

In [ ]:
df = pd.read_csv("green_tripdata_2019-09.csv", nrows=100)

In [ ]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
df

In [ ]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [ ]:
#df.to_sql(name='green_data', con=engine)
print(pd.io.sql.get_schema(df, name='yellow_taxi_data', con=engine))
#engine.

In [ ]:
#pd.read_sql(sql, con=engine)
df.to_sql(name='green_data', con=engine, index=False, schema='public')

In [ ]:
df_iter = pd.read_csv('green_tripdata_2019-09.csv', iterator=True, chunksize=100000)

In [ ]:
df = next(df_iter)

In [ ]:
len(df)

In [ ]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [ ]:
print(pd.io.sql.get_schema(df, name='green_trip_data', con=engine))

In [ ]:
df.head(n=0).to_sql(name='green_trip_data', con=engine, if_exists='replace')

In [ ]:
sql2 = "select 1"
pd.read_sql(sql2, con=engine)

In [ ]:
%time df.to_sql(name='green_trip_data', con=engine, if_exists='append')

In [ ]:
from time import time

In [ ]:
while True: 
    t_start = time()

    df = next(df_iter)

    df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
    df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
    
    df.to_sql(name='green_trip_data', con=engine, if_exists='append')

    t_end = time()

    print('inserted another chunk, took %.3f second' % (t_end - t_start))

In [15]:
!wget https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv

'wget' is not recognized as an internal or external command,
operable program or batch file.

In [16]:
df_zones = pd.read_csv('taxi+_zone_lookup.csv')

In [17]:
df_zones.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [18]:
df_zones.to_sql(name='zones', con=engine, if_exists='replace')

In [20]:
# Question 3. Count records
# How many taxi trips were totally made on September 18th 2019?
query1 = "select count(1) from green_trip_data where date(lpep_pickup_datetime) = '2019-09-18' and date(lpep_dropoff_datetime) = '2019-09-18';"
pd.read_sql(query1, con=engine)

   count
0  15612

In [25]:
# Question 4. Largest trip for each day
# Which was the pick up day with the largest trip distance Use the pick up time for your calculations.


query2 = """
select lpep_pickup_datetime from green_trip_data where lpep_pickup_datetime = ( select lpep_pickup_datetime from green_trip_data order by trip_distance desc limit 1);
"""
pd.read_sql(query2, con=engine)
# Now you can use sql_query in your Python code or pass it to a database connection to execute.

  lpep_pickup_datetime
0  2019-09-26 19:32:52

In [24]:
# Question 5. Three biggest pick up Boroughs
# Consider lpep_pickup_datetime in '2019-09-18' and ignoring Borough has Unknown

query3 = """
    SELECT "Borough", SUM(total_amount)
    FROM green_trip_data
    INNER JOIN zones ON "PULocationID" = "LocationID"
    WHERE DATE(lpep_pickup_datetime) = '2019-09-18'
    GROUP BY "Borough"
    HAVING SUM(total_amount) > 50000;
"""
pd.read_sql(query3, con=engine)
#

     Borough       sum
0   Brooklyn  96333.24
1  Manhattan  92271.30
2     Queens  78671.71

In [29]:
# Question 6. Largest tip
# For the passengers picked up in September 2019 in the zone name Astoria which was the drop off zone that had the largest tip? We want the name of the zone, not the id.
query4 = """
select "DOLocationID", "Zone", sum(tip_amount)  from green_trip_data inner join zones on "DOLocationID" = "LocationID" 
 where "PULocationID" = (select "LocationID" from zones where "Zone" = 'Astoria')  
group by 1,2 order by 3 desc limit 100;
""" 
pd.read_sql(query4, con=engine)

    DOLocationID                           Zone      sum
0              7                        Astoria  2135.36
1            223                       Steinway  1349.23
2            179                    Old Astoria  1148.49
3            146  Long Island City/Queens Plaza   710.27
4            226                      Sunnyside   574.25
..           ...                            ...      ...
95           225             Stuyvesant Heights    20.02
96             1                 Newark Airport    19.03
97            13              Battery Park City    18.86
98            42           Central Harlem North    18.76
99           143            Lincoln Square West    18.64

[100 rows x 3 columns]